In [1]:
import pandas as pd
list1 = ['mom', 'get', 'pandas', 'level']
s1 = pd.Series(list1)
s2 = pd.Series(['1', '2', '3'])
s1

0       mom
1       get
2    pandas
3     level
dtype: object

In [2]:
# 문자열의 길이를 반환한 리스트 생성
print(len('python'))
print(len(s1))

print(list(map(len, list1))) #apply로 시리즈에 적용

6
4
[3, 3, 6, 5]

In [3]:
s1.apply(len)

0    3
1    3
2    6
3    5
dtype: int64

In [4]:
s2.apply(int)

0    1
1    2
2    3
dtype: int64

In [5]:
# apply
# 5글자 이상의 회문을 답하라
data = [['강승주', 'mom'], ['송중기', 'get'], 
        ['권보아', 'pandas'], ['김판다', 'level']]
df = pd.DataFrame(data, columns=['이름', '답안'])
df

    이름      답안
0  강승주     mom
1  송중기     get
2  권보아  pandas
3  김판다   level

In [6]:
df['글자수'] = df['답안'].apply(len)
df

    이름      답안  글자수
0  강승주     mom    3
1  송중기     get    3
2  권보아  pandas    6
3  김판다   level    5

In [7]:
# 문자열을 역순으로 뒤집는 사용자 정의 함수
def rev1(x):
    return x[::-1]
rev1('get')

'teg'

In [8]:
# lambda 함수 : 사전에 정의 없이 바로 집어넣을 수 잇다.
rev2 = lambda x: x[::-1]
print(rev2('get'))

df['답안'].apply(lambda x: x[::-1])

teg

0       mom
1       teg
2    sadnap
3     level
Name: 답안, dtype: object

In [9]:
# apply로 사용자 정의함수 적용하기
df['역순'] = df['답안'].apply(lambda x: x[::-1])
df

    이름      답안  글자수      역순
0  강승주     mom    3     mom
1  송중기     get    3     teg
2  권보아  pandas    6  sadnap
3  김판다   level    5   level

In [10]:
# 다중요건 불리언 인덱싱
data = [['강승주', 'mom'], ['송중기', 'get'], 
        ['권보아', 'pandas'], ['김판다', 'level']]
df = pd.DataFrame(data, columns=['이름', '답안'])
df['글자수'] = df['답안'].apply(len)
df['역순'] = df['답안'].apply(lambda x: x[::-1])

df1 = pd.DataFrame([[71, 82], [91, 85], [81, 92]], 
                   index=list('ABC'), columns=['국어', '영어'])

In [11]:
df1

   국어  영어
A  71  82
B  91  85
C  81  92

In [12]:
df1[df1['국어'] > 80]

   국어  영어
B  91  85
C  81  92

In [13]:
cond1 = df1['국어'] > 80
df1[cond1]

   국어  영어
B  91  85
C  81  92

In [14]:
df1['국어'] < df1['영어']

A     True
B    False
C     True
dtype: bool

In [15]:
cond2 = df1['국어'] < df1['영어']
df1[cond2]

   국어  영어
A  71  82
C  81  92

In [16]:
# 국어 점수가 80점보다 높고 영어점수보다 낮은 사람을 찾는 조건
cond1 & cond2

A    False
B    False
C     True
dtype: bool

In [17]:
df1[cond1 & cond2]

   국어  영어
C  81  92

In [18]:
# 데이터로 실습하기
# 글자수가 5이상인 회문을 답변한 사람
cond1 = df['글자수'] >= 5
cond2 = df['답안'] == df['역순']
df[cond1 & cond2]

    이름     답안  글자수     역순
3  김판다  level    5  level

In [19]:
# 프로젝트 
# 해당 파일에서 3글자의 회문인 정답을 찾고, 정답자의 소속 시도(광역단체)를 파악하라
import pandas as pd
pd.options.display.max_rows = 6 # 판다스 버전업에 따라 6행 출력의 바뀐 코드
url = 'https://raw.githubusercontent.com/panda-kim/csv_files/main/palindrome.csv'
df_ex1 = pd.read_csv(url)
df_ex1

      이름                   주소    답안
0    류동영        경상북도 청도군 뒷마2길    메뉴
1    유지수        경상북도 문경시 청암3길   목욕탕
2    권민식  경기도 안양시 동안구 동편로49번길    야채
..   ...                  ...   ...
997  한성균       부산광역시 영도구 청학북로   스웨터
998  양대환         강원도 춘천시 하중도길    남북
999  이종봉       충청북도 단양군 여울목2길  해외여행

[1000 rows x 3 columns]

In [20]:
# lambda 함수 쉽게 만드는 법
x = '경상북도 청도군 뒷마2길'
x.split(' ')[0] # 이 코드를 lambda x: 다음에 넣으면 됨

'경상북도'

In [21]:
# 시도열 만들기
df_ex1['시도'] = df_ex1['주소'].apply(lambda x: x.split(' ')[0])
df_ex1

      이름                   주소    답안     시도
0    류동영        경상북도 청도군 뒷마2길    메뉴   경상북도
1    유지수        경상북도 문경시 청암3길   목욕탕   경상북도
2    권민식  경기도 안양시 동안구 동편로49번길    야채    경기도
..   ...                  ...   ...    ...
997  한성균       부산광역시 영도구 청학북로   스웨터  부산광역시
998  양대환         강원도 춘천시 하중도길    남북    강원도
999  이종봉       충청북도 단양군 여울목2길  해외여행   충청북도

[1000 rows x 4 columns]

In [22]:
cond1 = df_ex1['답안'].apply(len) == 3
cond2 = df_ex1['답안'].apply(lambda x: x[::-1]) == df_ex1['답안']

df_ex1.loc[cond1 & cond2, '시도']

35     서울특별시
41     인천광역시
57     서울특별시
617      경기도
917      강원도
Name: 시도, dtype: object

In [23]:
df_ex1.loc[cond1 & cond2, '시도'].value_counts()

시도
서울특별시    2
인천광역시    1
경기도      1
강원도      1
Name: count, dtype: int64

In [24]:
# 문자열 다루기
data = [['mom', 'cat01', 'cat-01', '   cat', 'cat01'], 
        ['get', 'dog02', 'dog-01', '  dog', '01cat'], 
        ['pandas', 'cow01', 'rabbit-01', ' cow', 'dog01'], 
        ['level', 'cow02', 'dog-02',  'cow', 'cow01']]
df = pd.DataFrame(data, columns=list('ABCDE'))
df

        A      B          C       D      E
0     mom  cat01     cat-01     cat  cat01
1     get  dog02     dog-01     dog  01cat
2  pandas  cow01  rabbit-01     cow  dog01
3   level  cow02     dog-02     cow  cow01

In [25]:
df['A'].apply(len)

0    3
1    3
2    6
3    5
Name: A, dtype: int64

In [26]:
df['A'].str.len()

0    3
1    3
2    6
3    5
Name: A, dtype: int64

In [27]:
df['B'].apply(lambda x: x[:3])

0    cat
1    dog
2    cow
3    cow
Name: B, dtype: object

In [28]:
df['B'].str[:3]

0    cat
1    dog
2    cow
3    cow
Name: B, dtype: object

In [29]:
df['C'].apply(lambda x: x.split('-')[0])

0       cat
1       dog
2    rabbit
3       dog
Name: C, dtype: object

In [30]:
df['C'].str.split('-').str[0]

0       cat
1       dog
2    rabbit
3       dog
Name: C, dtype: object

In [31]:
df['D'].apply(lambda x: 'cat' in x)

0     True
1    False
2    False
3    False
Name: D, dtype: bool

In [32]:
df['D'].str.contains('cat')

0     True
1    False
2    False
3    False
Name: D, dtype: bool

In [33]:
df['D'].str.contains(r'cat|dog')

0     True
1     True
2    False
3    False
Name: D, dtype: bool

In [34]:
df['E'].str.contains('cat')

0     True
1     True
2    False
3    False
Name: E, dtype: bool

In [35]:
# cat으로 시작
df['E'].str.contains('^cat')

0     True
1    False
2    False
3    False
Name: E, dtype: bool

In [36]:
# cat으로 끝
df['E'].str.contains('cat$')

0    False
1     True
2    False
3    False
Name: E, dtype: bool

In [37]:
df['E'].str.extract('(cat)')

     0
0  cat
1  cat
2  NaN
3  NaN

In [38]:
df['E'].str.extract('(cat|dog)')

     0
0  cat
1  cat
2  dog
3  NaN

In [39]:
# to_numeric
s1 = pd.Series(['87', '70', '98', '-'])
s1

0    87
1    70
2    98
3     -
dtype: object

In [40]:
# nan으로 반환
pd.to_numeric(s1, errors='coerce')

0    87.0
1    70.0
2    98.0
3     NaN
dtype: float64

In [41]:
# 그대로 반환
pd.to_numeric(s1, errors='ignore') # 전부 그대로 반환인 것임. 곧 없어질 거라 try-except 사용 권장

C:\Users\julia\AppData\Local\Temp\ipykernel_15284\3146340982.py:2: FutureWarning: errors='ignore' is deprecated and will raise in a future version. Use to_numeric without passing `errors` and catch exceptions explicitly instead
  pd.to_numeric(s1, errors='ignore') # 전부 그대로 반환인 것임. 곧 없어질 거라 try-except 사용 권장

0    87
1    70
2    98
3     -
dtype: object

In [42]:
# 데이터 프레임에 apply 사용하기
s1 = pd.Series(['87', '70', '98', '-'])
data1 = [['87', '-', '70'], ['70', '72', '73'], 
         ['98', '76', '-'], ['-', '77', '95']]
data2 = [[87, 99, 70], [70, 72, 73], [98, 76, 80], [93, 77, 95]]
df1 = pd.DataFrame(data1, index=list('ABCD'), columns=['국어', '영어', '수학'])
df2 = pd.DataFrame(data2, index=list('ABCD'), columns=['국어', '영어', '수학'])

data3 = [['강승주', 'A', '할인'], ['송중기', 'B', '할인'], 
         ['권보아', 'C', '할인'], ['강보경', 'C', '할인'], 
         ['김판다', 'A', '정상가'], ['박효신', 'A', '정상가']]

df3 = pd.DataFrame(data3, columns=['이름', '제품', '할인여부'])
df4 = pd.DataFrame([[5000, 4000], [1200, 1000], [2000, 1500]], 
                   index=list('ABC'), columns=['정상가', '할인'])

In [43]:
df1.apply(pd.to_numeric, errors='coerce')

     국어    영어    수학
A  87.0   NaN  70.0
B  70.0  72.0  73.0
C  98.0  76.0   NaN
D   NaN  77.0  95.0

In [44]:
df1.apply(pd.to_numeric, errors='coerce').info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, A to D
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국어      3 non-null      float64
 1   영어      3 non-null      float64
 2   수학      3 non-null      float64
dtypes: float64(3)
memory usage: 128.0+ bytes

In [45]:
# apply에서 axis 사용
df2.apply(sum, axis=1)

A    256
B    215
C    254
D    265
dtype: int64

In [46]:
df2.apply(lambda x: x[:2], axis=1)

   국어  영어
A  87  99
B  70  72
C  98  76
D  93  77

In [47]:
x = df3.iloc[0] # 첫 행을 x로 지정
df4.loc[x['제품'], x['할인여부']]

np.int64(4000)

In [48]:
df3['가격'] = df3.apply(lambda x: df4.loc[x['제품'], x['할인여부']], axis=1)
df3

    이름 제품 할인여부    가격
0  강승주  A   할인  4000
1  송중기  B   할인  1000
2  권보아  C   할인  1500
3  강보경  C   할인  1500
4  김판다  A  정상가  5000
5  박효신  A  정상가  5000